tap "hashicorp/tap"
tap "isen-ng/dotnet-sdk-versions"
# Tool to safely and precisely provision, manage, and destroy infrastructure
brew "hashicorp/tap/terraform"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Statistics utility to count lines of code
brew "cloc"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Dependency manager for Cocoa projects
brew "cocoapods"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Isolated development environments using Docker
brew "docker-compose"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Client library for huggingface.co hub
brew "hf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Cloud native development platform
brew "pulumi"
# Python version management - sole source of Python versions, no brew
# python@X.Y formulae (none were used as dependencies by anything else
# installed - pyenv install <version> && pyenv global <version> instead)
brew "pyenv"
# Ruby version manager
brew "rbenv"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Scripting with easy zero-conf dependency imports
brew "swift-sh"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for Vercel
brew "vercel-cli"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Chromium based browser
cask "arc"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Web debugging Proxy application
cask "charles"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8-0-400", trusted: true
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# .NET IDE
cask "rider"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "markwhen.markwhen"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "semanticdiff.semanticdiff"
vscode "sonarsource.sonarlint-vscode"
uv "specify-cli"
uv "suvadu"
npm "corepack"
npm "create-next-app"
npm "wgc"
npm "yarn"
